let launchs: Set<String> = ["매운돼지갈비", "라면", "김밥", "이삭토스트", "갈치찜", "삼계탕", "맘스터치", "버거킹"]

let dinners: Set<String> = ["치킨", "곱창", "초밥", "보쌈", "장어", "피자", "조개구이", "버거킹", "라면", "김밥"]

// 교집합
print(launchs.intersection(dinners))
// ["라면", "김밥", "버거킹"]

// 여집합: 합집합에서 교집합 제외
print(launchs.symmetricDifference(dinners))
// ["조개구이", "매운돼지갈비", "피자", "갈치찜", "곱창", "이삭토스트", "치킨", "장어", "보쌈", "삼계탕", "맘스터치", "초밥"]

// 합집합
print(launchs.union(dinners))
// ["이삭토스트", "버거킹", "김밥", "매운돼지갈비", "치킨", "초밥", "맘스터치", "조개구이", "갈치찜", "삼계탕", "보쌈", "피자", "곱창", "장어", "라면"]

// 차집합: 순수하게 점심에만 언급된 것들
print(launchs.subtracting(dinners))
// ["갈치찜", "이삭토스트", "삼계탕", "맘스터치", "매운돼지갈비"]
